posts/2015-01-13-maundy-thursday.org
#+date: <2015-01-13>
#+filetags: prayer
#+title: Maundy Thursday

The one who had already\\
shed all the privileges of God,\\
also shed his outer robe.\\
Wrapping himself in a simple towel,\\
he lovingly washed the disciples' feet\\
with his calloused hands.\\
\\
Teach us, Lord, to shed\\
our own trappings of power and prestige,\\
as we reach out to those rejected by the world;\\
and may we always have the grace to accept\\
the things that you have had the grace to offer.\\
\\

/Amen/


#+begin_tagline
Tagged: prayer
#+end_tagline
