docs/posts/2015-01-13-maundy-thursday.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 26, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Maundy Thursday</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Maundy Thursday</h1>
<p class="subtitle" role="doc-subtitle">Jan 13, 2015</p>
</header><p>
The one who had already<br>
shed all the privileges of God,<br>
also shed his outer robe.<br>
Wrapping himself in a simple towel,<br>
he lovingly washed the disciples&rsquo; feet<br>
with his calloused hands.<br>
<br>
Teach us, Lord, to shed<br>
our own trappings of power and prestige,<br>
as we reach out to those rejected by the world;<br>
and may we always have the grace to accept<br>
the things that you have had the grace to offer.<br>
<br>
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="orgcbba3c8">
<p>
Tagged: prayer
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 26, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
